Ran Plan for project: `team-ops-dev` dir: `terraform/teams/team-ops/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.archive_file.zips["policy"]: Read complete after 9s [id=ab1b7161d2109faa401cc1723af2f5e999b447e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket_object.archives["policy"] will be created
+ resource "google_storage_bucket_object" "archives" {
      + bucket         = "test"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "atlantis_metadata/policy.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./tmp/policy.zip"
      + storage_class  = (known after apply)
    }

  # module.external-data-landing-zone.google_project.project will be created
+ resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "019E58-6F6589-65814F"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "application" = "analytics"
          + "team"        = "ops"
        }
      + folder_id           = "123456789012"
      + id                  = (known after apply)
      + labels              = {
          + "application" = "analytics"
          + "team"        = "ops"
        }
      + name                = "ext-data-land"
      + number              = (known after apply)
      + project_id          = "data-team-lf6z"
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "application" = "analytics"
          + "team"        = "ops"
        }
    }

  # module.external-data-landing-zone.google_project_service.apis["compute.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "compute.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["container.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "container.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["iam.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "iam.googleapis.com"
    }

  # module.external-data-landing-zone.google_project_service.apis["storage.googleapis.com"] will be created
+ resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "data-team-lf6z"
      + service            = "storage.googleapis.com"
    }

Plan: 6 to add, 0 to change, 0 to destroy.


Running Conftest GCP policies:
1..4
not ok 1 - plan.json - main - Resource 'module.external-data-landing-zone.google_project.project' missing required labels: {"environment"}
# successes
ok 2 - plan.json - main - SUCCESS
ok 3 - plan.json - main - SUCCESS
ok 4 - plan.json - main - SUCCESS
Running Conftest Terraform policies:
1..1
# successes
ok 1 - plan.json - main - SUCCESS
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p team-ops-dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://8584f9ebbd5d:4141/lock?id=mailamiton%252Fgcp-infra-using-terraform%252Fterraform%252Fteams%252Fteam-ops%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p team-ops-dev
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```